app/views/users/show.html.erb


<% current_users.mansions.each do |mansion| %>
---
SELECT "mansions".* FROM "mansions" INNER JOIN "bookings" ON "mansions"."id" = "bookings"."mansion_id" WHERE "bookings"."user_id" = ?  [["user_id", 1]]