app/views/mansions/book.html.erb

SELECT  "mansions".* FROM "mansions"  WHERE "mansions"."id" = ? LIMIT 1  [["id", 146]]
---

	<% @mansion = Mansion.find(params[:id]) %>