app/views/mansions/show.html.erb

SELECT  1 AS one FROM "mansions" INNER JOIN "bookings" ON "mansions"."id" = "bookings"."mansion_id" WHERE "bookings"."user_id" = ? AND "mansions"."id" = 42 LIMIT 1  [["user_id", 1]]
SELECT "users".* FROM "users" INNER JOIN "bookings" ON "users"."id" = "bookings"."user_id" WHERE "bookings"."mansion_id" = ?  [["mansion_id", 42]]
SELECT COUNT(*) FROM "users" INNER JOIN "bookings" ON "users"."id" = "bookings"."user_id" WHERE "bookings"."mansion_id" = ?  [["mansion_id", 42]]
---
	<% if current_user %>
	<% unless current_user.mansions.include?(@mansion) %>
		<% if @mansion.users.count < @mansion.bedrooms %>