app/controllers/bookings_controller.rb

SELECT  "users".* FROM "users"  WHERE "users"."id" = 23  ORDER BY "users"."id" ASC LIMIT 1
---
	def create
		mansion = Mansion.find(params[:id])
		if current_user
			Booking.find_by(mansion_id: mansion.id)
			mansion.users << User.find(current_user.id)

SELECT  "users".* FROM "users"  WHERE "users"."id" = 23  ORDER BY "users"."id" ASC LIMIT 1
SELECT  "bookings".* FROM "bookings"  WHERE "bookings"."mansion_id" = 141 LIMIT 1
SELECT  "users".* FROM "users"   ORDER BY "users"."id" DESC LIMIT 1
---
	def show
		@user = User.find(session[:user_id])
		@users = Booking.find_by(mansion_id: params[:id]).mansion.users
		# we remove the user from the users pledge so that when we compare for percentage the same user isnt comparing to himself, the variable mates exclude the user that is comparing
		@mates = []
		@users.each do |mate|