app/controllers/mansions_controller.rb

SELECT COUNT(*) FROM "mansions"  WHERE "mansions"."country" = 'Mexico'
SELECT "mansions".* FROM "mansions"  WHERE "mansions"."country" = 'Mexico'
SELECT "mansions".* FROM "mansions"
---
  def index
    #@mansions = Mansion.all
    location=params[:location]
    if Mansion.all.pluck("country").include?(location.titleize)
      @location=params[:location].titleize
      @mansions=Mansion.where(country: @location)
    elsif Mansion.all.pluck("city").include?(location.titleize)
      @location=params[:location].titleize
      @mansions=Mansion.where(city: @location)
    elsif Mansion.all.pluck("region").include?(location.titleize)
      @location=params[:location].titleize
      @mansions=Mansion.where(region: @location)
    elsif params[:location]==""
      @location="the universe"
      @mansions=Mansion.all

SELECT  "mansions".* FROM "mansions"  WHERE "mansions"."id" = ? LIMIT 1  [["id", 42]]
---
  def show
    @mansion = Mansion.find(params[:id])

SELECT  "mansions".* FROM "mansions"  WHERE "mansions"."id" = ? LIMIT 1  [["id", 146]]
INSERT INTO "bookings" ("created_at", "mansion_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-08-17 17:39:47.701409"], ["mansion_id", 205], ["updated_at", "2014-08-17 17:39:47.701409"], ["user_id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 23  ORDER BY "users"."id" ASC LIMIT 1
---
  def book
    mansion = Mansion.find(params[:id])
    if current_user
      Booking.find_by(mansion_id: mansion.id)
      mansion.users << User.find(current_user.id)

SELECT  "mansions".* FROM "mansions"  WHERE "mansions"."id" = ? LIMIT 1  [["id", 205]]
---
  def leave
    mansion = Mansion.find(params[:id])