app/controllers/mansions_controller.rb

SELECT  "mansions".* FROM "mansions"   ORDER BY "mansions"."name" ASC LIMIT 4 OFFSET 0
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "mansions"  LIMIT 4 OFFSET 0) subquery_for_count
---
  def index
    #@mansions = Mansion.all
    @mansions=Mansion.order(:name).page(params[:page]).per(4)